DataProcessors/umk_ИмпортЦенИз77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>umk_ИмпортЦенИз77</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэфУмножить</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэфРазделить</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизацияТМЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОЛЕ</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроводитьНулевыеЗначения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексСтрокиТаблицыЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/umk_ИмпортЦенИз77/Ext/ObjectModule.bsl
Процедура Подключить() Экспорт
	ОЛЕ = Новый COMОбъект("V77.Application");
	Подключено = ОЛЕ.Initialize(ОЛЕ.RMTrade, "/d"+ СокрЛП(Путь) + " /n" + СокрЛП(ИмяПользователя) + " /p" + СокрЛП(Пароль) , "No_Splash_Show");	//--- Пароль
																	
	Если НЕ Подключено Тогда
#Если Клиент Тогда
		Предупреждение("Ошибка инициализации 1С:Предприятия 77!!!");
#КонецЕсли				
		ОЛЕ = 0;
		Возврат;
	КонецЕсли;	
КонецПроцедуры

Процедура Отключить() Экспорт
	ОЛЕ.ExecuteBatch("ЗавершитьРаботуСистемы()");
	ОЛЕ = "";
	Подключено = Ложь;	
КонецПроцедуры

Функция ВернутьЦенуТМЦ(Товар, КатегорияЦены)
	
	ЦеныТовара = ОЛЕ.CreateObject("Справочник.Цены");
	ЦеныТовара.ИспользоватьВладельца(Товар);
	ЦеныТовара.ВыбратьЭлементыПоРеквизиту("КатегорияЦены", КатегорияЦены, 1, 0);
	Пока ЦеныТовара.ПолучитьЭлемент()  = 1 Цикл
		Если ЦеныТовара.ПометкаУдаления() = 0 Тогда
			Возврат Новый Структура("Цена, Ед", ЦеныТовара.Цена.Получить(НаДату), СтрЗаменить(ЦеныТовара.Единица.Получить(НаДату).Наименование,".","") );
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Цена, Ед",0,"");	
КонецФункции

Процедура Предупредить(ТекстПредупреждения)
#Если Клиент Тогда
		Предупреждение(ТекстПредупреждения);
#Иначе
		Сообщить(ТекстПредупреждения);
#КонецЕсли	
КонецПроцедуры

Процедура ИмпортироватьЦены() Экспорт
	Если НЕ Подключено Тогда
		Предупредить("Необходимо выполнить подключение");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипЦен) Тогда
		Предупредить("Необходимо выбрать тип цен");
		Возврат;
	КонецЕсли;
	
	СпрТМЦВнеш = ОЛЕ.CreateObject("Справочник.ТМЦ");
	СпрТМЦВнеш1 = ОЛЕ.CreateObject("Справочник.ТМЦ");
	СпрТМЦВнеш1.НайтиПоКоду("00017");
	
	СпрКЦВнеш = ОЛЕ.CreateObject("Справочник.КатегорииЦен");	
	Если СпрКЦВнеш.НайтиПоНаименованию(НаименованиеПр, 0, 1) = 0 Тогда
		Предупредить("В производстве не найден тип цен с указанным наименованием");
		Возврат;
	КонецЕсли;
	
	ТабКодов = Новый ТаблицаЗначений;
    ТабКодов.Колонки.Добавить("КодС");
	ТабКодов.Колонки.Добавить("Код");
	ТабКодов.Колонки.Добавить("Наименование");
	

	
	НачатьТранзакцию();	
	ДокУЦ = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокУЦ, глЗначениеПеременной("глТекущийПользователь"),,,Неопределено,Неопределено);
	СтрТЦ = ДокУЦ.ТипыЦен.Добавить();
	СтрТЦ.ТипЦен = ТипЦен;
	ДокУЦ.Ответственный = глЗначениеПеременной("глТекущийПользователь");
	ДокУЦ.Комментарий = "Импорт из Производства: " + Строка(ТекущаяДата()) + " в " + Строка(ТекущаяДата());
	Гривна = Константы.ВалютаРегламентированногоУчета.Получить();
	ДокУЦ.Дата = НаДату;
	СпособРасчета = ТипЦен.СпособРасчетаЦены;
//	ДокУЦ.Записать();

#Если Клиент Тогда
	Состояние("Импортирую цены");
#КонецЕсли
	СпрТМЦВнеш.ИспользоватьРодителя(СпрТМЦВнеш1.ТекущийЭлемент());
	СпрТМЦВнеш.ВыбратьЭлементы();
	Пока СпрТМЦВнеш.ПолучитьЭлемент() = 1 Цикл		
		Если СпрТМЦВнеш.Уровень() < 3 ИЛИ СпрТМЦВнеш.ПометкаУдаления() = 1 ИЛИ СпрТМЦВнеш.ЭтоГруппа() = 1 Тогда //--- УМК Сандомирский В.Ю. (17.09.14) нужные ТМЦ лежат на 3м уровне вложенности
			Продолжить;
		КонецЕсли;
		
		Ссылка = Справочники.Номенклатура.ПустаяСсылка();
		Если СинхронизацияТМЦ = 1 Тогда
			Ссылка = Справочники.Номенклатура.НайтиПоКоду(СпрТМЦВнеш.Код, Ложь);
		ИначеЕсли СинхронизацияТМЦ = 2 Тогда
			Ссылка = Справочники.Номенклатура.НайтиПоНаименованию(СпрТМЦВнеш.Наименование, Ложь);
		ИначеЕсли СинхронизацияТМЦ = 3 Тогда
			Если СокрЛП(СпрТМЦВнеш.КодС) <> "" Тогда
				Ссылка = umk_Доработки.НоменклатураПоКодуСинхронизации(СокрЛП(СпрТМЦВнеш.КодС), ТекущаяДата());//Справочники.Номенклатура.НайтиПоРеквизиту("umk_КодС", СпрТМЦВнеш.КодС);
			КонецЕсли;
		ИначеЕсли СинхронизацияТМЦ = 4 Тогда
			Если СокрЛП(СпрТМЦВнеш.СтарыйПолныйКод) <> "" Тогда
				Ссылка = Справочники.Номенклатура.НайтиПоРеквизиту("umk_СтарыйПолныйКод", СпрТМЦВнеш.СтарыйПолныйКод,1);
			КонецЕсли;			
		КонецЕсли;
				
		Если НЕ Ссылка.Пустая() Тогда
			
			Парам = Новый Структура("КодС", СпрТМЦВнеш.КодС);
			СтрокиПоиска = ТабКодов.НайтиСтроки(Парам);
			
			Если Не СтрокиПоиска.Количество() = 0 Тогда
				Для Каждого Стр Из СтрокиПоиска Цикл
					Сообщить("1с77 Номенклатура - " + Строка(СпрТМЦВнеш.Наименование) + " Код - " + Строка(СпрТМЦВнеш.Код) + Символы.ПС +
					"И Номенклатура - "
					+ Строка(Стр.Наименование)
					+ " Код - " + Строка(Стр.Код) + " имеют общий код синхр. - " + Строка(СпрТМЦВнеш.КодС) + Символы.ПС, СтатусСообщения.Важное);
				КонецЦикла;
			КонецЕсли;

			
			НоваяСтрока = ТабКодов.Добавить();
			НоваяСтрока.Код =СпрТМЦВнеш.Код; 
			НоваяСтрока.КодС = СпрТМЦВнеш.КодС;
			НоваяСтрока.Наименование = СпрТМЦВнеш.Наименование;
					
			СтруктураЦена = ВернутьЦенуТМЦ(СпрТМЦВнеш.ТекущийЭлемент(), СпрКЦВнеш.ТекущийЭлемент());
			Цена = СтруктураЦена.Цена;
			Ед   = СтруктураЦена.Ед;
			Цена = Окр(Цена * КоэфУмножить / КоэфРазделить, 2);
			
			ЦенаСт = Ценообразование.ПолучитьЦенуНоменклатуры(Ссылка, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(),
										ТипЦен, НаДату, Ссылка.ЕдиницаХраненияОстатков,
										Гривна, 1, 1, ,	Справочники.ДоговорыКонтрагентов.ПустаяСсылка(), Справочники.УсловияПродаж.ПустаяСсылка());

			//ЦенаСт = глВернутьЦену(СпрТМЦ.ТекущийЭлемент(), ВыбКЦ, НаДату, Гривня);
			//Если (Цена <> 0) И (Цена <> ЦенаСт) Тогда
				Стр = ДокУЦ.Товары.Добавить();
				Стр.Номенклатура = Ссылка;
				Стр.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(Ед,,,Ссылка);
				Если Не ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
					Сообщить("Не найдена единица измер. " + Ед +  " для " + Строка(Ссылка), СтатусСообщения.Важное);
				КонецЕсли;
				Стр.СпособРасчетаЦены = СпособРасчета;
				Стр.Валюта = Гривна;
				Стр.ТипЦен = ТипЦен;
				Стр.Цена = Цена;
				Если Не ЦенаСт = Цена Тогда 
					Сообщить( "Код синхр ||" +  Строка(СокрЛП(СпрТМЦВнеш.КодС)) + "|| " +  Строка(Ссылка) + "||" + Строка(СпрТМЦВнеш.Наименование) + "||"
					+ Символы.ПС +
					"старая цена - " + Строка(ЦенаСт) + "|| новая цена - " + Строка(Цена) 
					+ Символы.ПС + 
					"________________________________________________________________________________________________________",
					СтатусСообщения.Внимание);
				КонецЕсли;
			//КонецЕсли;					
		КонецЕсли;		
	КонецЦикла;
	
	Если ДокУЦ.Товары.Количество() > 0 Тогда
		ДокУЦ.Записать();
		Сообщить(ДокУЦ);
	КонецЕсли;
	
#Если Клиент Тогда	
	Если Вопрос("Сохранить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
	    ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;
#Иначе
	ЗафиксироватьТранзакцию();
#КонецЕсли
КонецПроцедуры
